-- phpMyAdmin SQL Dump
-- version 4.1.6
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2017 年 6 朁E20 日 02:07
-- サーバのバージョン： 5.6.16
-- PHP Version: 5.5.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `primetechnohatsugai`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `transcation`
--

CREATE TABLE IF NOT EXISTS `transcation` (
  `trans_id` int(11) NOT NULL AUTO_INCREMENT,
  `user_id` int(11) NOT NULL,
  `other_id` int(11) NOT NULL,
  `trans_cash` bigint(20) NOT NULL,
  `trans_flag` char(1) NOT NULL,
  `trans_date` date NOT NULL,
  `inp_date` date NOT NULL,
  PRIMARY KEY (`trans_id`),
  KEY `user_id` (`user_id`),
  KEY `other_id` (`other_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=sjis AUTO_INCREMENT=99 ;

--
-- テーブルのデータのダンプ `transcation`
--

INSERT INTO `transcation` (`trans_id`, `user_id`, `other_id`, `trans_cash`, `trans_flag`, `trans_date`, `inp_date`) VALUES
(2, 1, 2, 50000, '0', '2017-05-23', '2017-05-23'),
(3, 1, 2, 50000, '0', '2017-05-24', '2017-05-24'),
(4, 2, 1, 20000, '0', '2017-05-24', '2017-05-24'),
(5, 4, 1, 12345, '0', '2017-05-24', '2017-05-24'),
(6, 1, 4, 11111, '0', '2017-05-24', '2017-05-24'),
(7, 1, 2, 100, '0', '2017-05-24', '2017-05-24'),
(8, 1, 4, 209, '0', '2017-05-24', '2017-05-24'),
(9, 4, 2, 8000, '1', '2017-06-30', '2017-05-24'),
(10, 1, 4, 5555, '0', '2017-05-25', '2017-05-25'),
(11, 5, 1, 10000, '0', '2017-05-25', '2017-05-25'),
(12, 1, 4, 10000, '0', '2017-05-26', '2017-05-26'),
(17, 1, 2, 1000, '0', '2017-06-11', '2017-05-26'),
(30, 1, 4, 100, '0', '2017-05-29', '2017-05-29'),
(31, 1, 7, 1080, '0', '2017-05-29', '2017-05-29'),
(32, 1, 7, 2160, '0', '2017-05-29', '2017-05-29'),
(33, 1, 7, 4980, '0', '2017-05-29', '2017-05-29'),
(34, 2, 7, 6000, '0', '2017-05-29', '2017-05-29'),
(35, 2, 7, 3980, '0', '2017-05-29', '2017-05-29'),
(36, 2, 7, 1500, '0', '2017-05-29', '2017-05-29'),
(37, 2, 7, 2000, '0', '2017-05-29', '2017-05-29'),
(38, 4, 7, 1000, '0', '2017-05-29', '2017-05-29'),
(39, 4, 7, 2000, '0', '2017-05-29', '2017-05-29'),
(40, 4, 7, 5980, '0', '2017-05-29', '2017-05-29'),
(41, 4, 7, 2800, '0', '2017-05-29', '2017-05-29'),
(42, 5, 7, 108, '0', '2017-05-29', '2017-05-29'),
(43, 5, 7, 108, '0', '2017-05-29', '2017-05-29'),
(44, 5, 7, 108, '0', '2017-05-29', '2017-05-29'),
(45, 5, 7, 108, '0', '2017-05-29', '2017-05-29'),
(46, 5, 7, 108, '0', '2017-05-29', '2017-05-29'),
(47, 6, 7, 100000, '0', '2017-05-29', '2017-05-29'),
(48, 6, 7, 8000, '0', '2017-05-29', '2017-05-29'),
(49, 6, 7, 200000, '0', '2017-05-29', '2017-05-29'),
(50, 7, 5, 540, '0', '2017-05-29', '2017-05-29'),
(51, 7, 6, 308000, '0', '2017-05-29', '2017-05-29'),
(52, 1, 4, 8000, '0', '2017-05-31', '2017-05-31'),
(53, 2, 1, 10000, '0', '2017-05-31', '2017-05-31'),
(54, 2, 1, 12000, '1', '2017-06-30', '2017-05-31'),
(55, 4, 1, 15000, '1', '2017-07-17', '2017-05-31'),
(57, 7, 2, 2000, '1', '2017-06-20', '2017-05-31'),
(58, 7, 1, 4980, '1', '2017-06-20', '2017-05-31'),
(59, 2, 5, 10000, '0', '2017-05-31', '2017-05-31'),
(61, 1, 4, 10000, '1', '2017-08-31', '2017-05-31'),
(62, 1, 7, 1080, '0', '2017-06-02', '2017-06-02'),
(63, 1, 4, 1000, '0', '2017-06-10', '2017-06-02'),
(64, 1, 7, 10000, '0', '2017-06-06', '2017-06-06'),
(65, 9, 7, 2160, '0', '2017-06-07', '2017-06-07'),
(66, 9, 7, 2160, '0', '2017-06-07', '2017-06-07'),
(67, 9, 7, 9980, '0', '2017-06-07', '2017-06-07'),
(68, 9, 7, 100000, '0', '2017-06-07', '2017-06-07'),
(69, 9, 7, 148000, '0', '2017-06-07', '2017-06-07'),
(70, 9, 7, 40, '0', '2017-06-07', '2017-06-07'),
(71, 9, 7, 444, '0', '2017-06-07', '2017-06-07'),
(72, 4, 7, 810, '0', '2017-06-07', '2017-06-07'),
(73, 4, 7, 110, '0', '2017-06-07', '2017-06-07'),
(74, 4, 7, 4285, '0', '2017-06-07', '2017-06-07'),
(75, 4, 7, 6000, '0', '2017-06-07', '2017-06-07'),
(76, 4, 7, 7000, '0', '2017-06-07', '2017-06-07'),
(77, 4, 7, 11450, '0', '2017-06-07', '2017-06-07'),
(78, 8, 1, 10000, '0', '2017-06-07', '2017-06-07'),
(79, 8, 7, 1000, '0', '2017-06-07', '2017-06-07'),
(80, 8, 7, 2000, '0', '2017-06-07', '2017-06-07'),
(81, 8, 1, 1000, '0', '2017-06-07', '2017-06-07'),
(82, 7, 8, 20000, '0', '2017-06-08', '2017-06-08'),
(83, 7, 4, 1500, '0', '2017-06-08', '2017-06-08'),
(84, 7, 4, 1800, '0', '2017-06-08', '2017-06-08'),
(85, 1, 4, 1000, '0', '2017-06-08', '2017-06-08'),
(86, 7, 8, 10000, '0', '2017-06-09', '2017-06-09'),
(98, 5, 21, 20000, '0', '2017-06-12', '2017-06-12');

-- --------------------------------------------------------

--
-- テーブルの構造 `user`
--

CREATE TABLE IF NOT EXISTS `user` (
  `user_id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(40) NOT NULL,
  `furigana` varchar(40) NOT NULL,
  `birthday` date NOT NULL,
  `user_ad` varchar(100) NOT NULL,
  `tel` varchar(10) NOT NULL,
  `mobile` varchar(11) DEFAULT NULL,
  `mail` varchar(50) DEFAULT NULL,
  `property` char(1) NOT NULL DEFAULT '0',
  `user_work_nm` varchar(100) DEFAULT NULL,
  `user_work_ad` varchar(100) DEFAULT NULL,
  `user_work_tel` varchar(10) DEFAULT NULL,
  `account_no` varchar(10) NOT NULL,
  `passwd` varchar(15) NOT NULL,
  `passno` varchar(4) NOT NULL,
  `account_balance` bigint(20) NOT NULL,
  `inp_date` date NOT NULL,
  `upd_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`user_id`),
  UNIQUE KEY `account_no` (`account_no`)
) ENGINE=InnoDB  DEFAULT CHARSET=sjis AUTO_INCREMENT=23 ;

--
-- テーブルのデータのダンプ `user`
--

INSERT INTO `user` (`user_id`, `name`, `furigana`, `birthday`, `user_ad`, `tel`, `mobile`, `mail`, `property`, `user_work_nm`, `user_work_ad`, `user_work_tel`, `account_no`, `passwd`, `passno`, `account_balance`, `inp_date`, `upd_date`) VALUES
(1, '山田一', 'ヤマダハジメ', '1996-06-06', '東京都千代田区秋葉原秋葉原テラス221', '031234567', '09012345678', 'renshu@email.com', '0', '株式会社サンプルクリエイト', '東京都中央区八丁堀1-2-3', '0335551666', '0010000001', 'password', '0000', 102551, '2017-05-22', '2017-06-08 05:29:37'),
(2, '愛植尾', 'アイウエオ', '1998-11-23', '東京都千代田区秋葉原秋葉原テラス222', '031234568', '09012345679', 'aiueo@email.com', '0', '株式会社プライムテクノ', '東京都中央区八丁堀2-33-1', '0335551666', '0010000002', 'password', '0000', 105843, '2017-05-22', '2017-05-31 08:16:00'),
(3, '試験', 'シケン', '2000-01-01', '試験', '0000000000', '00000000000', 'test@email.com', '0', '試験', '試験', '0000000000', '0000000000', 'password', '0000', 0, '2017-06-12', '2017-06-12 07:16:54'),
(4, '富良野手九郎', 'フラノテクロウ', '1984-11-11', '東京都新宿区東早稲田早稲田モール1234', '0333332232', '09012333333', 'furano@p-tec.jp', '0', '株式会社プライムテクノ', '東京都中央区八丁堀3-10-3 正和ビル', '0335551666', '0010000003', 'password', '0000', 976331, '2017-05-23', '2017-06-08 05:29:37'),
(5, '佐藤啓太', 'サトウケイタ', '2000-01-01', '削除済み', '0', NULL, NULL, '0', NULL, NULL, NULL, '0010000004', 'deleted', '0', 0, '2017-05-25', '2017-06-12 08:37:01'),
(6, '田中太郎', 'タナカタロウ', '1985-03-04', '福岡県福岡市中央区夕日町1-2-3-44', '0927101234', '09012345678', 'tanaka@email.jp', '0', '田中スチール', '福岡県福岡市中央区夕日町1-2-3-33', '0927100000', '0010000005', 'password', '0000', 0, '2017-05-25', '2017-05-29 07:24:03'),
(7, 'サンプルショッピング', 'サンプルショッピング', '2017-02-01', '東京都中央区銀座1-2-2222', '0334567890', '09012345678', 'sample@email.jp', '1', '', '', '', '0010000006', 'password', '0000', 306699, '2017-05-26', '2017-06-09 04:48:29'),
(8, '初谷惇志', 'ハツガイアツシ', '1993-06-07', '神奈川県横浜市港北区境1-2-1111', '0451234567', '09011111111', 'hatsugai@p-tec.jp', '0', '', '', '', '0010000007', 'password', '0000', 16000, '2017-06-02', '2017-06-20 00:07:33'),
(9, '斉藤隆', 'サイトウタカシ', '1957-03-15', '福岡県福岡市中央区二本町33-4', '0120222333', '08011113333', 'saito@email.com', '0', '', '', '', '0010000008', 'password', '0000', 9737216, '2017-06-07', '2017-06-07 00:38:00'),
(21, '12341231234567', 'ソウキンサキ', '2000-01-01', '送金先', '0', NULL, NULL, '1', NULL, NULL, NULL, '0000000001', 'password', '0', 0, '2017-06-12', '2017-06-12 08:37:01'),
(22, '田中太郎', 'タナカタロウ', '1990-03-03', '山梨県山梨市あああああ', '', '', '', '0', '', '', '', '0010000009', 'password123', '1234', 0, '2017-06-16', '2017-06-16 07:41:28');

--
-- ダンプしたテーブルの制約
--

--
-- テーブルの制約 `transcation`
--
ALTER TABLE `transcation`
  ADD CONSTRAINT `transcation_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`),
  ADD CONSTRAINT `transcation_ibfk_2` FOREIGN KEY (`other_id`) REFERENCES `user` (`user_id`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
