# -- standard errors --
errors.header=<UL>
errors.prefix=<LI><font color="red">
errors.suffix=</font></LI>
errors.footer=</UL>
# -- validator --
errors.invalid={0} is invalid.
errors.maxlength={0} can not be greater than {1} characters.
errors.minlength={0} can not be less than {1} characters.
errors.range={0} is not in the range {1} through {2}.
errors.required={0} is required.
errors.byte={0} must be an byte.
errors.date={0} is not a date.
errors.double={0} must be an double.
errors.float={0} must be an float.
errors.integer={0} must be an integer.
errors.long={0} must be an long.
errors.short={0} must be an short.
errors.creditcard={0} is not a valid credit card number.
errors.email={0} is an invalid e-mail address.
# -- other --
errors.cancel=Operation cancelled.
errors.detail={0}
errors.general=The process did not complete. Details should follow.
errors.token=Request could not be completed. Operation is not in sequence.
# -- welcome --
welcome.title=Struts Blank Application
welcome.heading=Welcome!
welcome.message=To get started on your own application, copy the struts-blank.war to a new WAR file using the name for your application. Place it in your container's "webapp" folder (or equivalent), and let your container auto-deploy the application. Edit the skeleton configuration files as needed, restart your container, and you are on your way! (You can find the application.properties file with this message in the /WEB-INF/src/java/resources folder.)
accountNumber=\u53e3\u5ea7\u756a\u53f7
password=\u30d1\u30b9\u30ef\u30fc\u30c9
login=\u30ed\u30b0\u30a4\u30f3
createAccount=\u53e3\u5ea7\u958b\u8a2d
deleteAccount=\u53e3\u5ea7\u89e3\u7d04
name=\u304a\u540d\u524d
furigana=\u304a\u540d\u524d\uff08\u30d5\u30ea\u30ac\u30ca\uff09
birthday=\u751f\u5e74\u6708\u65e5
uAddress=\u81ea\u5b85\u4f4f\u6240
tel=\u96fb\u8a71\u756a\u53f7
mobile=\u643a\u5e2f\u96fb\u8a71\u756a\u53f7
mail=\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9
zokusei=\u53e3\u5ea7\u5c5e\u6027
passno=\u6697\u8a3c\u756a\u53f7
worknm=\u52e4\u52d9\u5148\u540d
workad=\u52e4\u52d9\u5730\u4f4f\u6240
worktel=\u52e4\u52d9\u5148\u96fb\u8a71\u756a\u53f7
bankcode=\u91d1\u878d\u6a5f\u95a2\u30b3\u30fc\u30c9
blanchcode=\u652f\u5e97\u30b3\u30fc\u30c9
create=\u958b\u8a2d
logout=\u30ed\u30b0\u30a2\u30a6\u30c8
menu=\u30e1\u30cb\u30e5\u30fc
zandaka=\u6b8b\u9ad8
transcation=\u632f\u8fbc
continueTranscation=\u7d9a\u3051\u3066\u632f\u8fbc
delete=\u53d6\u6d88
deleteOutstandingConf=\u53d6\u6d88
return=\u623b\u308b
back=\u524d\u3078
next=\u6b21\u3078
search=\u7167\u4f1a
resetSearch=\u7167\u4f1a\u6761\u4ef6\u89e3\u9664
conf=\u78ba\u8a8d
transcationconf=\u632f\u8fbc\u78ba\u8a8d
transHistory=\u53d6\u5f15\u5c65\u6b74
outstanding=\u632f\u8fbc\u672a\u6c7a\u6e08\u8868\u793a
tologin=\u30ed\u30b0\u30a4\u30f3\u753b\u9762\u3078
kaiyaku=\u89e3\u7d04
#format
numberformat.currency=###,###,###,###,###
#\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u8a2d\u5b9a
error.name.required=\u304a\u540d\u524d\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002
error.furigana.required=\u30d5\u30ea\u30ac\u30ca\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002
error.furigana.mask=\u30d5\u30ea\u30ac\u30ca\u306f\u30ab\u30bf\u30ab\u30ca\uff08\u5168\u89d2\uff09\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.uPrefAddress.required=\u90fd\u9053\u5e9c\u770c\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002
error.uCityAddress.required=\u5e02\u533a\u753a\u6751\u540d\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002
error.uConstructure.required=\u756a\u5730\u7b49\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002
error.tel.integer=\u96fb\u8a71\u756a\u53f7\u306f\u6570\u5b57\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.mobile.integer=\u643a\u5e2f\u96fb\u8a71\u756a\u53f7\u306f\u6570\u5b57\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.mail.email=\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u306e\u5f62\u5f0f\u304c\u4e0d\u6b63\u3067\u3059\u3002
error.zokusei.required=\u53e3\u5ea7\u5c5e\u6027\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002
error.passwordc.required=\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002
error.passwordc.mask=\u30d1\u30b9\u30ef\u30fc\u30c9\u306b\u306f\u534a\u89d2\u82f1\u6570\u5b57\u3092\u4e21\u65b9\u4f7f\u7528\u3057\u3066\u5165\u529b\u304f\u3060\u3055\u3044\u3002
error.passwordc.minlength=\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u6700\u4f4e5\u6587\u5b57\u4ee5\u4e0a\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.passwordconf.required=\u30d1\u30b9\u30ef\u30fc\u30c9\uff08\u78ba\u8a8d\u7528\uff09\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002
error.passwordconf.mask=\u30d1\u30b9\u30ef\u30fc\u30c9\uff08\u78ba\u8a8d\u7528\uff09\u306b\u306f\u534a\u89d2\u82f1\u6570\u5b57\u3092\u4e21\u65b9\u4f7f\u7528\u3057\u3066\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.passwordconf.minlength=\u30d1\u30b9\u30ef\u30fc\u30c9\uff08\u78ba\u8a8d\u7528\uff09\u306f\u6700\u4f4e5\u6587\u5b57\u4ee5\u4e0a\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.password.wrong=\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u4e00\u81f4\u3057\u3066\u3044\u307e\u305b\u3093\u3002
error.passno.required=\u6697\u8a3c\u756a\u53f7\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002
error.passno.mask=\u6697\u8a3c\u756a\u53f7\u306b\u306f\u534a\u89d2\u6570\u5b57\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.passno.temp=\u6697\u8a3c\u756a\u53f7\u306b\u306f\u751f\u5e74\u6708\u65e5\u3084\u9023\u756a\u306f\u4f7f\u7528\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
error.passnoconf.required=\u6697\u8a3c\u756a\u53f7\uff08\u78ba\u8a8d\u7528\uff09\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002
error.passnoconf.mask=\u6697\u8a3c\u756a\u53f7\uff08\u78ba\u8a8d\u7528\uff09\u306b\u306f\u534a\u89d2\u6570\u5b57\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.passno.wrong=\u6697\u8a3c\u756a\u53f7\u304c\u4e00\u81f4\u3057\u3066\u3044\u307e\u305b\u3093\u3002
error.worktel.integer=\u52e4\u52d9\u5148\u96fb\u8a71\u756a\u53f7\u306f\u6570\u5b57\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.password.required=\u53e3\u5ea7\u756a\u53f7\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002
error.password.notaccount=\u53e3\u5ea7\u756a\u53f7\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u6b63\u3057\u304f\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.katakanac.required=\u30ab\u30bf\u30ab\u30ca\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002
error.katakanac.mask=\u30ab\u30bf\u30ab\u30ca\u306f\u30ab\u30bf\u30ab\u30ca\u3092\u5168\u89d2\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.katakana.required=\u304a\u53d6\u5f15\u5148\u540d\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002
error.katakana.mask=\u304a\u53d6\u5f15\u5148\u540d\u306f\u30ab\u30bf\u30ab\u30ca\u3092\u5168\u89d2\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.otherAccountNumber.required=\u304a\u53d6\u5f15\u5148\u53e3\u5ea7\u756a\u53f7\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002
error.otherAccountNumber.long=\u304a\u53d6\u5f15\u5148\u53e3\u5ea7\u756a\u53f7\u306f\u534a\u89d2\u6570\u5b57\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.furikomi.required=\u304a\u632f\u8fbc\u984d\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002
error.furikomi.long=\u304a\u632f\u8fbc\u984d\u306f\u534a\u89d2\u6570\u5b57\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.furikomi.longrange=\u304a\u632f\u8fbc\u984d\u306f1\u4ee5\u4e0a\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.furikomibi.past=\u304a\u632f\u8fbc\u65e5\u306f\u672c\u65e5\u4ee5\u964d\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.furilomibi.notexist=\u304a\u632f\u8fbc\u307f\u65e5\u306f\u5b58\u5728\u3059\u308b\u65e5\u4ed8\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.otherAccount.notfound=\u304a\u53d6\u5f15\u5148\u540d\u3001\u304a\u53d6\u5f15\u5148\u53e3\u5ea7\u756a\u53f7\u304c\u9593\u9055\u3063\u3066\u3044\u307e\u3059\u3002
error.passwordd.required=\u53e3\u5ea7\u756a\u53f7\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u3001\u6697\u8a3c\u756a\u53f7\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002
error.password.nohit=\u53e3\u5ea7\u756a\u53f7\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u3001\u6697\u8a3c\u756a\u53f7\u306f\u6b63\u3057\u304f\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.accountNumber.long=\u53e3\u5ea7\u756a\u53f7\u306f\u534a\u89d2\u6570\u5b57\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.passworde.mask=\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u534a\u89d2\u82f1\u6570\u5b57\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.bankcode.mask=\u91d1\u878d\u6a5f\u95a2\u30b3\u30fc\u30c9\u306f\u534a\u89d2\u6570\u5b57\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.blanchcode.mask=\u652f\u5e97\u30b3\u30fc\u30c9\u306f\u534a\u89d2\u6570\u5b57\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.otherAccountNumberB.long=\u632f\u8fbc\u5148\u53e3\u5ea7\u756a\u53f7\u306f\u534a\u89d2\u6570\u5b57\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.accountnumber.required=\u91d1\u878d\u6a5f\u95a2\u30b3\u30fc\u30c9\u3001\u652f\u5e97\u30b3\u30fc\u30c9\u3001\u53e3\u5ea7\u756a\u53f7\u306f\u5fc5\u9808\u4e8b\u9805\u3067\u3059\u3002